; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph1 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Star5 thermograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon7 infrared0)
	(have_image Phenomenon8 infrared2)
	(have_image Planet9 infrared2)
	(have_image Planet10 infrared2)
))

)

; plan
1. (turn_to satellite1 star4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star4)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 7
5. (turn_to satellite0 star3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star3)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon6 instrument3 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 7
10. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 2 of 7
11. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
12. (take_image satellite0 star5 instrument0 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 3 of 7
13. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 7
14. (take_image satellite1 phenomenon8 instrument3 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 4 of 7
15. (turn_to satellite1 planet10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet10)
   goals met: 4 of 7
16. (take_image satellite1 planet10 instrument3 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 5 of 7
17. (turn_to satellite1 planet9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet9)
   goals met: 5 of 7
18. (take_image satellite1 planet9 instrument3 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 6 of 7
19. (turn_to satellite1 groundstation2 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation2)
   goals met: 7 of 7
